src/xiaofang.Dispatch-Modify-Participants.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
  xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
  xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
  xmlns:ns="urn:xiaofang">
 <SOAP-ENV:Body  SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
  <ns:Dispatch-Modify-Participants>
   <request>
    <group-id>
     <id>0</id>
     <name></name>
     <entity-type>UNIT</entity-type>
     <parentid>0</parentid>
    </group-id>
    <modify-type>Increased</modify-type>
    <participants>
     <id>0</id>
     <group>
      <id>0</id>
      <name></name>
      <entity-type>UNIT</entity-type>
      <parentid>0</parentid>
     </group>
     <account>
      <id>0</id>
      <name></name>
      <entity-type>UNIT</entity-type>
      <parentid>0</parentid>
     </account>
     <priority>0</priority>
     <call-privilege>CallForbid</call-privilege>
     <toke-privilege>TokenForbid</toke-privilege>
     <status>IDLE</status>
     <sync-added>false</sync-added>
    </participants>
    <participants>
     <id>0</id>
     <group>
      <id>0</id>
      <name></name>
      <entity-type>UNIT</entity-type>
      <parentid>0</parentid>
     </group>
     <account>
      <id>0</id>
      <name></name>
      <entity-type>UNIT</entity-type>
      <parentid>0</parentid>
     </account>
     <priority>0</priority>
     <call-privilege>CallForbid</call-privilege>
     <toke-privilege>TokenForbid</toke-privilege>
     <status>IDLE</status>
     <sync-added>false</sync-added>
    </participants>
   </request>
  </ns:Dispatch-Modify-Participants>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
